os/message_passing.html
---
layout: page
title: Message_passing
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Message Passing</h2>
<div class="outline-text-2" id="text-1">
<p>
Message Passing ermöglich sowohl Prozesssynchronisation als auch
Kommunikation zwischen Prozessen über die Operationen:
</p>

<ul class="org-ul">
<li><code>send(⟨destination⟩, ⟨message⟩)</code>
</li>
<li><code>receive(⟨destination⟩, ⟨message⟩)</code>
</li>
</ul>

<p>
Sender und Empfänger können:
</p>

<ul class="org-ul">
<li>direkt miteinander Daten austauschen (<i>direct addressing</i>)

<ul class="org-ul">
<li>nur 1-zu-1 Kommunikation möglich
</li>
</ul>
</li>

<li>indirekt über eine <i>Mailbox/Pipe</i> Daten austauschen (<i>indirect
adressing</i>)

<ul class="org-ul">
<li>ermglicht n-zu-m Kommunikation
</li>
</ul>
</li>
</ul>

<p>
Man unterscheidet verschiedene Semantiken:
</p>

<ul class="org-ul">
<li><b>blocking send &amp; blocking receive (Rendezvous)</b>: Sender und Empfänger
werden blockiert
</li>
<li><b>non-blocking send &amp; blocking receive</b>: Sender wird blockiert;
Empfänger wird blockiert, bis die Nachricht empfangen wurde
</li>
<li><b>non-blocking send &amp; non-blocking receive</b>: weder Sender noch
Empfänger werden blockiert
</li>
</ul>
</div>
</div>
